/*
***************************************************************************************************
*                                         APPLICATION CODE
*
*                      (c) Copyright 2016; Guangdong ENECO Science And Technology Co.,Ltd
*
*               All rights reserved.  Protected by international copyright laws.
*               Knowledge of the source code may NOT be used without authorization.
***************************************************************************************************
*/

/********************************************************************************************************
* Filename      :  bsp_atmel_25256b_sshl.h
* Programmer(s) :  Fanjun
* Version       :  V1.0
* data          :  2016.12.27
* brief         :  This file contains all the functions prototypes for the system run
*                  config parameters firmware library.
*********************************************************************************************************/
#ifndef __BSP_ATMEL_25256B_SSHL_H__
#define __BSP_ATMEL_25256B_SSHL_H__
/*
***************************************************************************************************
*                                                 MODULE
*
* Note(s) : (1) This header file is protected from multiple pre-processor inclusion through use of the
*               BSP present pre-processor macro definition.
***************************************************************************************************
*/

/*
***************************************************************************************************
*                                           INCLUDE FILES
***************************************************************************************************
*/
#include "includes.h"
/*
***************************************************************************************************
*                                           MACRO DEFINITIONS
***************************************************************************************************
*/
#define AT25256B_CS             (GPIO_ResetBits(GPIOA, BSP_GPIOA_PIN15_STM_SPI_NSS_PORT_NMB));//AT25256B的片选信号
#define AT25256B_NCS            (GPIO_SetBits(GPIOA, BSP_GPIOA_PIN15_STM_SPI_NSS_PORT_NMB));

//AT25256B指令表
#define WREN                0x06 //WREN
#define WRDI                0x04 //WRDI
#define RDSR                0x05 //RDSR
#define WRSR                0x01 //WRSR
#define READ                0x03 //READ
#define WRITE               0x02 //WRITE
/*
***************************************************************************************************
*                                           EXPORTED DATA TYPE
***************************************************************************************************
*/

/*
***************************************************************************************************
*                              EXPORTED GLOBAL VARIABLE DECLARATIONS
***************************************************************************************************
*/

/*
***************************************************************************************************
*                                           EXPORTED MACRO
***************************************************************************************************
*/

/*
***************************************************************************************************
*                                           EXPORTED FUNCTION
***************************************************************************************************
*/
void AT25256B_Init(void);

uint8_t AT25256B_ReadSR(void);
void AT25256B_Write_SR(uint8_t sr);

void AT25256B_Read(u8 *pBuffer, u16 ReadAddr, u16 NumByteToRead);
void AT25256B_Write(u8 *pBuffer, u16 WriteAddr, u16 NumByteToWrite);

/*
***************************************************************************************************
*                                             MODULE END
***************************************************************************************************
*/


#endif                                                          /* End of module include */
